[Killed] ConditionalExpression
server/src/services/approval-service.ts:122:9
   }
 
   decideApproval(id: string, approved: boolean, decidedBy: string, reason?: string): ApprovalRequest {
-    if (typeof approved !== 'boolean') {
+    if (false) {
       throw new Error('INVALID_APPROVAL_DECISION: approved must be a boolean.');
     }
killedBy: critical HTTP contracts rejects coerced decisions and preserves terminal approvals
statusReason: expected 200 to be 400 // Object.is equality

[Killed] BlockStatement
server/src/services/approval-service.ts:122:40
   }
 
   decideApproval(id: string, approved: boolean, decidedBy: string, reason?: string): ApprovalRequest {
-    if (typeof approved !== 'boolean') {
-      throw new Error('INVALID_APPROVAL_DECISION: approved must be a boolean.');
-    }
+    if (typeof approved !== 'boolean') {}
     const updated = this.db.transaction(() => {
       const approval = this.getApproval(id);
killedBy: critical HTTP contracts rejects coerced decisions and preserves terminal approvals
statusReason: expected 200 to be 400 // Object.is equality

[Killed] CallExpression
server/src/services/approval-service.ts:123:7
 
   decideApproval(id: string, approved: boolean, decidedBy: string, reason?: string): ApprovalRequest {
     if (typeof approved !== 'boolean') {
-      throw new Error('INVALID_APPROVAL_DECISION: approved must be a boolean.');
+      ;
     }
     const updated = this.db.transaction(() => {
killedBy: critical HTTP contracts rejects coerced decisions and preserves terminal approvals
statusReason: expected 200 to be 400 // Object.is equality

[Killed] BlockStatement
server/src/services/approval-service.ts:127:22
     }
     const updated = this.db.transaction(() => {
       const approval = this.getApproval(id);
-      if (!approval) {
-        throw new Error('Approval not found');
-      }
+      if (!approval) {}
       if (approval.status === ApprovalStatus.EXPIRED) {
         throw new Error('APPROVAL_EXPIRED: Expired approvals cannot authorize execution.');
killedBy: manual action approval lifecycle persists review, rejects self-approval, records independent evidence without dispatching
statusReason: expected [Function] to throw error including 'Approval not found' but got 'Cannot read properties of null (readi…'

[Killed] ConditionalExpression
server/src/services/approval-service.ts:127:11
     }
     const updated = this.db.transaction(() => {
       const approval = this.getApproval(id);
-      if (!approval) {
+      if (false) {
         throw new Error('Approval not found');
       }
killedBy: manual action approval lifecycle persists review, rejects self-approval, records independent evidence without dispatching
statusReason: expected [Function] to throw error including 'Approval not found' but got 'Cannot read properties of null (readi…'

[Killed] CallExpression
server/src/services/approval-service.ts:128:9
     const updated = this.db.transaction(() => {
       const approval = this.getApproval(id);
       if (!approval) {
-        throw new Error('Approval not found');
+        ;
       }
       if (approval.status === ApprovalStatus.EXPIRED) {
killedBy: manual action approval lifecycle persists review, rejects self-approval, records independent evidence without dispatching
statusReason: expected [Function] to throw error including 'Approval not found' but got 'Cannot read properties of null (readi…'

[Killed] BlockStatement
server/src/services/approval-service.ts:130:55
       if (!approval) {
         throw new Error('Approval not found');
       }
-      if (approval.status === ApprovalStatus.EXPIRED) {
-        throw new Error('APPROVAL_EXPIRED: Expired approvals cannot authorize execution.');
-      }
+      if (approval.status === ApprovalStatus.EXPIRED) {}
       if (approval.status !== ApprovalStatus.PENDING) {
         throw new Error('Approval already processed');
killedBy: critical HTTP contracts exercises auth and approval success/error contracts
statusReason: expected 500 to be 410 // Object.is equality

[Killed] ConditionalExpression
server/src/services/approval-service.ts:130:11
       if (!approval) {
         throw new Error('Approval not found');
       }
-      if (approval.status === ApprovalStatus.EXPIRED) {
+      if (false) {
         throw new Error('APPROVAL_EXPIRED: Expired approvals cannot authorize execution.');
       }
killedBy: critical HTTP contracts exercises auth and approval success/error contracts
statusReason: expected 500 to be 410 // Object.is equality

[Killed] CallExpression
server/src/services/approval-service.ts:131:9
         throw new Error('Approval not found');
       }
       if (approval.status === ApprovalStatus.EXPIRED) {
-        throw new Error('APPROVAL_EXPIRED: Expired approvals cannot authorize execution.');
+        ;
       }
       if (approval.status !== ApprovalStatus.PENDING) {
killedBy: critical HTTP contracts exercises auth and approval success/error contracts
statusReason: expected 500 to be 410 // Object.is equality

[Killed] ConditionalExpression
server/src/services/approval-service.ts:133:11
       if (approval.status === ApprovalStatus.EXPIRED) {
         throw new Error('APPROVAL_EXPIRED: Expired approvals cannot authorize execution.');
       }
-      if (approval.status !== ApprovalStatus.PENDING) {
+      if (true) {
         throw new Error('Approval already processed');
       }
killedBy: critical HTTP contracts rejects coerced decisions and preserves terminal approvals
statusReason: expected 500 to be 200 // Object.is equality

[Killed] ConditionalExpression
server/src/services/approval-service.ts:133:11
       if (approval.status === ApprovalStatus.EXPIRED) {
         throw new Error('APPROVAL_EXPIRED: Expired approvals cannot authorize execution.');
       }
-      if (approval.status !== ApprovalStatus.PENDING) {
+      if (false) {
         throw new Error('Approval already processed');
       }
killedBy: manual action approval lifecycle persists review, rejects self-approval, records independent evidence without dispatching
statusReason: promise resolved "null" instead of rejecting

[Killed] CallExpression
server/src/services/approval-service.ts:134:9
         throw new Error('APPROVAL_EXPIRED: Expired approvals cannot authorize execution.');
       }
       if (approval.status !== ApprovalStatus.PENDING) {
-        throw new Error('Approval already processed');
+        ;
       }
       if (!approval.expires_at || !(new Date(approval.expires_at).getTime() > Date.now())) {
killedBy: manual action approval lifecycle persists review, rejects self-approval, records independent evidence without dispatching
statusReason: promise resolved "null" instead of rejecting

[Killed] BooleanLiteral
server/src/services/approval-service.ts:136:11
       if (approval.status !== ApprovalStatus.PENDING) {
         throw new Error('Approval already processed');
       }
-      if (!approval.expires_at || !(new Date(approval.expires_at).getTime() > Date.now())) {
+      if (approval.expires_at || !(new Date(approval.expires_at).getTime() > Date.now())) {
         // Persist expiry and its audit together; throw only after that commit.
         return this.expireApprovalRecord(approval)!;
killedBy: manual action approval lifecycle persists review, rejects self-approval, records independent evidence without dispatching
statusReason: expected [Function] to throw error including 'SELF_APPROVAL_FORBIDDEN' but got 'APPROVAL_EXPIRED: Expired approvals c…'

[Killed] EqualityOperator
server/src/services/approval-service.ts:136:37
       if (approval.status !== ApprovalStatus.PENDING) {
         throw new Error('Approval already processed');
       }
-      if (!approval.expires_at || !(new Date(approval.expires_at).getTime() > Date.now())) {
+      if (!approval.expires_at || !(new Date(approval.expires_at).getTime() <= Date.now())) {
         // Persist expiry and its audit together; throw only after that commit.
         return this.expireApprovalRecord(approval)!;
killedBy: critical HTTP contracts rejects coerced decisions and preserves terminal approvals
statusReason: expected 410 to be 200 // Object.is equality

[Killed] ConditionalExpression
server/src/services/approval-service.ts:143:11
       // SECURITY INVARIANT: Self-approval prevention.
       // The maker (requested_by) cannot be the approver (decided_by).
       // This enforces separation of duties at the data layer.
-      if (approval.requested_by && decidedBy === approval.requested_by) {
+      if (true) {
         throw new Error('SELF_APPROVAL_FORBIDDEN: The maker cannot approve their own request. Independent approval required.');
       }
killedBy: manual action approval lifecycle persists review, rejects self-approval, records independent evidence without dispatching
statusReason: SELF_APPROVAL_FORBIDDEN: The maker cannot approve their own request. Independent approval required.

[Killed] EqualityOperator
server/src/services/approval-service.ts:143:36
       // SECURITY INVARIANT: Self-approval prevention.
       // The maker (requested_by) cannot be the approver (decided_by).
       // This enforces separation of duties at the data layer.
-      if (approval.requested_by && decidedBy === approval.requested_by) {
+      if (approval.requested_by && decidedBy !== approval.requested_by) {
         throw new Error('SELF_APPROVAL_FORBIDDEN: The maker cannot approve their own request. Independent approval required.');
       }
killedBy: manual action approval lifecycle persists review, rejects self-approval, records independent evidence without dispatching
statusReason: promise resolved "null" instead of rejecting

[Killed] CallExpression
server/src/services/approval-service.ts:144:9
       // The maker (requested_by) cannot be the approver (decided_by).
       // This enforces separation of duties at the data layer.
       if (approval.requested_by && decidedBy === approval.requested_by) {
-        throw new Error('SELF_APPROVAL_FORBIDDEN: The maker cannot approve their own request. Independent approval required.');
+        ;
       }
       const now = new Date().toISOString();
killedBy: manual action approval lifecycle persists review, rejects self-approval, records independent evidence without dispatching
statusReason: promise resolved "null" instead of rejecting
