[Killed] BlockStatement
src/execution/executors/docker-sandbox-executor.ts:108:103
     return session;
   }
 
-  private getInnerCommand(task: Task, options?: ExecutorOptions): { command: string; args: string[] } {
-    if (!this.inner.buildCommand) {
-      throw new Error('DOCKER_SANDBOX_INNER_COMMAND_UNAVAILABLE');
-    }
-    return this.inner.buildCommand(task, { ...options, workingDirectory: '/workspace' });
-  }
+  private getInnerCommand(task: Task, options?: ExecutorOptions): { command: string; args: string[] } {}
 
   private spawnDockerProcess(containerName: string, dockerArgs: string[]): Promise<number> {
killedBy: DockerSandboxExecutor passes the real inner task command to Docker from start()
statusReason: Cannot destructure property 'command' of 'this.getInnerCommand(...)' as it is undefined.

[Killed] ConditionalExpression
src/execution/executors/docker-sandbox-executor.ts:109:9
   }
 
   private getInnerCommand(task: Task, options?: ExecutorOptions): { command: string; args: string[] } {
-    if (!this.inner.buildCommand) {
+    if (false) {
       throw new Error('DOCKER_SANDBOX_INNER_COMMAND_UNAVAILABLE');
     }
killedBy: DockerSandboxExecutor fails closed when an inner executor cannot build its command
statusReason: expected [Function] to throw error including 'DOCKER_SANDBOX_INNER_COMMAND_UNAVAILA…' but got 'this.inner.buildCommand is not a func…'

[Killed] ConditionalExpression
src/execution/executors/docker-sandbox-executor.ts:109:9
   }
 
   private getInnerCommand(task: Task, options?: ExecutorOptions): { command: string; args: string[] } {
-    if (!this.inner.buildCommand) {
+    if (true) {
       throw new Error('DOCKER_SANDBOX_INNER_COMMAND_UNAVAILABLE');
     }
killedBy: DockerSandboxExecutor passes the real inner task command to Docker from start()
statusReason: DOCKER_SANDBOX_INNER_COMMAND_UNAVAILABLE

[Killed] CallExpression
src/execution/executors/docker-sandbox-executor.ts:110:7
 
   private getInnerCommand(task: Task, options?: ExecutorOptions): { command: string; args: string[] } {
     if (!this.inner.buildCommand) {
-      throw new Error('DOCKER_SANDBOX_INNER_COMMAND_UNAVAILABLE');
+      ;
     }
     return this.inner.buildCommand(task, { ...options, workingDirectory: '/workspace' });
killedBy: DockerSandboxExecutor fails closed when an inner executor cannot build its command
statusReason: expected [Function] to throw error including 'DOCKER_SANDBOX_INNER_COMMAND_UNAVAILA…' but got 'this.inner.buildCommand is not a func…'
