[Killed] BlockStatement
server/src/services/tool-broker.ts:244:107
    * here prevents callers from accidentally turning a durable token into a
    * bearer token at an effect boundary.
    */
-  validateCapabilityToken(token_id: string, tool: string, task_id: string, principal_id: string): boolean {
-    // Durable state is authoritative across broker instances and revocation.
-    const token = this.loadCapabilityToken(token_id);
-    if (!token) return false;
-    if (token.tool !== tool) return false;
-    if (token.task_id !== task_id) return false;
-    if (token.principal_id !== principal_id) return false;
-    const expiry = Date.parse(token.expires_at);
-    if (!Number.isFinite(expiry) || expiry <= Date.now()) {
-      this.db.prepare('DELETE FROM tool_broker_capability_tokens WHERE token_id = ?').run(token_id);
-      return false;
-    }
-    return true;
-  }
+  validateCapabilityToken(token_id: string, tool: string, task_id: string, principal_id: string): boolean {}
 
   /**
killedBy: Security Invariant: ToolBroker validates capability tokens correctly
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
server/src/services/tool-broker.ts:247:9
   validateCapabilityToken(token_id: string, tool: string, task_id: string, principal_id: string): boolean {
     // Durable state is authoritative across broker instances and revocation.
     const token = this.loadCapabilityToken(token_id);
-    if (!token) return false;
+    if (false) return false;
     if (token.tool !== tool) return false;
     if (token.task_id !== task_id) return false;
killedBy: Security Invariant: ToolBroker validates capability tokens correctly
statusReason: Cannot read properties of undefined (reading 'tool')

[Killed] BooleanLiteral
server/src/services/tool-broker.ts:247:24
   validateCapabilityToken(token_id: string, tool: string, task_id: string, principal_id: string): boolean {
     // Durable state is authoritative across broker instances and revocation.
     const token = this.loadCapabilityToken(token_id);
-    if (!token) return false;
+    if (!token) return true;
     if (token.tool !== tool) return false;
     if (token.task_id !== task_id) return false;
killedBy: Security Invariant: ToolBroker validates capability tokens correctly
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
server/src/services/tool-broker.ts:248:9
     // Durable state is authoritative across broker instances and revocation.
     const token = this.loadCapabilityToken(token_id);
     if (!token) return false;
-    if (token.tool !== tool) return false;
+    if (false) return false;
     if (token.task_id !== task_id) return false;
     if (token.principal_id !== principal_id) return false;
killedBy: Security Invariant: ToolBroker validates capability tokens correctly
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
server/src/services/tool-broker.ts:248:37
     // Durable state is authoritative across broker instances and revocation.
     const token = this.loadCapabilityToken(token_id);
     if (!token) return false;
-    if (token.tool !== tool) return false;
+    if (token.tool !== tool) return true;
     if (token.task_id !== task_id) return false;
     if (token.principal_id !== principal_id) return false;
killedBy: Security Invariant: ToolBroker validates capability tokens correctly
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
server/src/services/tool-broker.ts:249:9
     const token = this.loadCapabilityToken(token_id);
     if (!token) return false;
     if (token.tool !== tool) return false;
-    if (token.task_id !== task_id) return false;
+    if (token.task_id === task_id) return false;
     if (token.principal_id !== principal_id) return false;
     const expiry = Date.parse(token.expires_at);
killedBy: Security Invariant: ToolBroker validates capability tokens correctly
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
server/src/services/tool-broker.ts:249:9
     const token = this.loadCapabilityToken(token_id);
     if (!token) return false;
     if (token.tool !== tool) return false;
-    if (token.task_id !== task_id) return false;
+    if (true) return false;
     if (token.principal_id !== principal_id) return false;
     const expiry = Date.parse(token.expires_at);
killedBy: Security Invariant: ToolBroker validates capability tokens correctly
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
server/src/services/tool-broker.ts:250:53
     if (!token) return false;
     if (token.tool !== tool) return false;
     if (token.task_id !== task_id) return false;
-    if (token.principal_id !== principal_id) return false;
+    if (token.principal_id !== principal_id) return true;
     const expiry = Date.parse(token.expires_at);
     if (!Number.isFinite(expiry) || expiry <= Date.now()) {
killedBy: Security Invariant: ToolBroker validates capability tokens correctly
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
server/src/services/tool-broker.ts:250:9
     if (!token) return false;
     if (token.tool !== tool) return false;
     if (token.task_id !== task_id) return false;
-    if (token.principal_id !== principal_id) return false;
+    if (true) return false;
     const expiry = Date.parse(token.expires_at);
     if (!Number.isFinite(expiry) || expiry <= Date.now()) {
killedBy: Security Invariant: ToolBroker validates capability tokens correctly
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
server/src/services/tool-broker.ts:252:37
     if (token.task_id !== task_id) return false;
     if (token.principal_id !== principal_id) return false;
     const expiry = Date.parse(token.expires_at);
-    if (!Number.isFinite(expiry) || expiry <= Date.now()) {
+    if (!Number.isFinite(expiry) || expiry < Date.now()) {
       this.db.prepare('DELETE FROM tool_broker_capability_tokens WHERE token_id = ?').run(token_id);
       return false;
killedBy: Security Invariant: ToolBroker rejects corrupt or expired durable token expiry even after it was cached
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
server/src/services/tool-broker.ts:252:37
     if (token.task_id !== task_id) return false;
     if (token.principal_id !== principal_id) return false;
     const expiry = Date.parse(token.expires_at);
-    if (!Number.isFinite(expiry) || expiry <= Date.now()) {
+    if (!Number.isFinite(expiry) || false) {
       this.db.prepare('DELETE FROM tool_broker_capability_tokens WHERE token_id = ?').run(token_id);
       return false;
killedBy: Security Invariant: ToolBroker rejects corrupt or expired durable token expiry even after it was cached
statusReason: expected true to be false // Object.is equality

[Killed] CallExpression
server/src/services/tool-broker.ts:253:7
     if (token.principal_id !== principal_id) return false;
     const expiry = Date.parse(token.expires_at);
     if (!Number.isFinite(expiry) || expiry <= Date.now()) {
-      this.db.prepare('DELETE FROM tool_broker_capability_tokens WHERE token_id = ?').run(token_id);
+      ;
       return false;
     }
killedBy: Security Invariant: ToolBroker rejects corrupt or expired durable token expiry even after it was cached
statusReason: expected { n: 1 } to deeply equal { n: +0 }

[Killed] BooleanLiteral
server/src/services/tool-broker.ts:254:14
     const expiry = Date.parse(token.expires_at);
     if (!Number.isFinite(expiry) || expiry <= Date.now()) {
       this.db.prepare('DELETE FROM tool_broker_capability_tokens WHERE token_id = ?').run(token_id);
-      return false;
+      return true;
     }
     return true;
killedBy: Security Invariant: ToolBroker rejects corrupt or expired durable token expiry even after it was cached
statusReason: expected true to be false // Object.is equality
