[Killed] BlockStatement
server/src/routes/runtime-governance.ts:20:61
   return limit;
 }
 
-function isGovernanceScore(value: unknown): value is number {
-  return typeof value === 'number' && value >= 0 && value <= 10;
-}
+function isGovernanceScore(value: unknown): value is number {}
 
 export function createRuntimeGovernanceRoutes(
killedBy: critical HTTP contracts exercises every runtime-governance and spawn control contract
statusReason: expected 400 to be 200 // Object.is equality

[Killed] LogicalOperator
server/src/routes/runtime-governance.ts:21:10
 }
 
 function isGovernanceScore(value: unknown): value is number {
-  return typeof value === 'number' && value >= 0 && value <= 10;
+  return typeof value === 'number' && value >= 0 || value <= 10;
 }
 
killedBy: runtime governance release HTTP contract rejects invalid baseline scores without writing and persists an in-range baseline
statusReason: expected 200 to be 400 // Object.is equality

[Killed] ConditionalExpression
server/src/routes/runtime-governance.ts:21:10
 }
 
 function isGovernanceScore(value: unknown): value is number {
-  return typeof value === 'number' && value >= 0 && value <= 10;
+  return false;
 }
 
killedBy: critical HTTP contracts exercises every runtime-governance and spawn control contract
statusReason: expected 400 to be 200 // Object.is equality

[Killed] MethodExpression
server/src/routes/runtime-governance.ts:53:69
   // POST /api/runtime-governance/agents/:agentId/register — register baseline
   router.post('/agents/:agentId/register', requirePermission('write:governance'), (req, res) => {
     const { overallScore, categoryScores, certifiedAt } = req.body ?? {};
-    const normalizedCertifiedAt = typeof certifiedAt === 'string' ? certifiedAt.trim() : '';
+    const normalizedCertifiedAt = typeof certifiedAt === 'string' ? certifiedAt : '';
     const validCategoryScores = categoryScores !== null
       && typeof categoryScores === 'object'
killedBy: runtime governance release HTTP contract rejects invalid baseline scores without writing and persists an in-range baseline
statusReason: expected 400 to be 200 // Object.is equality

[Killed] EqualityOperator
server/src/routes/runtime-governance.ts:53:35
   // POST /api/runtime-governance/agents/:agentId/register — register baseline
   router.post('/agents/:agentId/register', requirePermission('write:governance'), (req, res) => {
     const { overallScore, categoryScores, certifiedAt } = req.body ?? {};
-    const normalizedCertifiedAt = typeof certifiedAt === 'string' ? certifiedAt.trim() : '';
+    const normalizedCertifiedAt = typeof certifiedAt !== 'string' ? certifiedAt.trim() : '';
     const validCategoryScores = categoryScores !== null
       && typeof categoryScores === 'object'
killedBy: runtime governance release HTTP contract rejects invalid baseline scores without writing and persists an in-range baseline
statusReason: expected 500 to be 400 // Object.is equality

[Killed] LogicalOperator
server/src/routes/runtime-governance.ts:54:33
   router.post('/agents/:agentId/register', requirePermission('write:governance'), (req, res) => {
     const { overallScore, categoryScores, certifiedAt } = req.body ?? {};
     const normalizedCertifiedAt = typeof certifiedAt === 'string' ? certifiedAt.trim() : '';
-    const validCategoryScores = categoryScores !== null
-      && typeof categoryScores === 'object'
+    const validCategoryScores = categoryScores !== null || typeof categoryScores === 'object'
       && !Array.isArray(categoryScores)
       && Object.values(categoryScores as Record<string, unknown>).every(isGovernanceScore);
killedBy: runtime governance release HTTP contract rejects invalid baseline scores without writing and persists an in-range baseline
statusReason: expected 500 to be 400 // Object.is equality

[Killed] ConditionalExpression
server/src/routes/runtime-governance.ts:54:33
   router.post('/agents/:agentId/register', requirePermission('write:governance'), (req, res) => {
     const { overallScore, categoryScores, certifiedAt } = req.body ?? {};
     const normalizedCertifiedAt = typeof certifiedAt === 'string' ? certifiedAt.trim() : '';
-    const validCategoryScores = categoryScores !== null
-      && typeof categoryScores === 'object'
-      && !Array.isArray(categoryScores)
-      && Object.values(categoryScores as Record<string, unknown>).every(isGovernanceScore);
+    const validCategoryScores = true;
     if (!isGovernanceScore(overallScore) || !validCategoryScores || !normalizedCertifiedAt || !Number.isFinite(Date.parse(normalizedCertifiedAt))) {
       res.status(400).json({ error: { message: 'scores must be between 0 and 10 and certifiedAt must be a valid timestamp', code: 'VALIDATION_ERROR' } });
killedBy: runtime governance release HTTP contract rejects invalid baseline scores without writing and persists an in-range baseline
statusReason: expected 200 to be 400 // Object.is equality

[Killed] EqualityOperator
server/src/routes/runtime-governance.ts:55:10
     const { overallScore, categoryScores, certifiedAt } = req.body ?? {};
     const normalizedCertifiedAt = typeof certifiedAt === 'string' ? certifiedAt.trim() : '';
     const validCategoryScores = categoryScores !== null
-      && typeof categoryScores === 'object'
+      && typeof categoryScores !== 'object'
       && !Array.isArray(categoryScores)
       && Object.values(categoryScores as Record<string, unknown>).every(isGovernanceScore);
killedBy: runtime governance release HTTP contract rejects invalid baseline scores without writing and persists an in-range baseline
statusReason: expected 200 to be 400 // Object.is equality

[Killed] ConditionalExpression
server/src/routes/runtime-governance.ts:55:10
     const { overallScore, categoryScores, certifiedAt } = req.body ?? {};
     const normalizedCertifiedAt = typeof certifiedAt === 'string' ? certifiedAt.trim() : '';
     const validCategoryScores = categoryScores !== null
-      && typeof categoryScores === 'object'
+      && true
       && !Array.isArray(categoryScores)
       && Object.values(categoryScores as Record<string, unknown>).every(isGovernanceScore);
killedBy: runtime governance release HTTP contract rejects invalid baseline scores without writing and persists an in-range baseline
statusReason: expected 200 to be 400 // Object.is equality

[Killed] BooleanLiteral
server/src/routes/runtime-governance.ts:56:10
     const normalizedCertifiedAt = typeof certifiedAt === 'string' ? certifiedAt.trim() : '';
     const validCategoryScores = categoryScores !== null
       && typeof categoryScores === 'object'
-      && !Array.isArray(categoryScores)
+      && Array.isArray(categoryScores)
       && Object.values(categoryScores as Record<string, unknown>).every(isGovernanceScore);
     if (!isGovernanceScore(overallScore) || !validCategoryScores || !normalizedCertifiedAt || !Number.isFinite(Date.parse(normalizedCertifiedAt))) {
killedBy: runtime governance release HTTP contract rejects invalid baseline scores without writing and persists an in-range baseline
statusReason: expected 200 to be 400 // Object.is equality

[Killed] MethodExpression
server/src/routes/runtime-governance.ts:57:10
     const validCategoryScores = categoryScores !== null
       && typeof categoryScores === 'object'
       && !Array.isArray(categoryScores)
-      && Object.values(categoryScores as Record<string, unknown>).every(isGovernanceScore);
+      && Object.values(categoryScores as Record<string, unknown>).some(isGovernanceScore);
     if (!isGovernanceScore(overallScore) || !validCategoryScores || !normalizedCertifiedAt || !Number.isFinite(Date.parse(normalizedCertifiedAt))) {
       res.status(400).json({ error: { message: 'scores must be between 0 and 10 and certifiedAt must be a valid timestamp', code: 'VALIDATION_ERROR' } });
killedBy: critical HTTP contracts exercises every runtime-governance and spawn control contract
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BooleanLiteral
server/src/routes/runtime-governance.ts:58:69
       && typeof categoryScores === 'object'
       && !Array.isArray(categoryScores)
       && Object.values(categoryScores as Record<string, unknown>).every(isGovernanceScore);
-    if (!isGovernanceScore(overallScore) || !validCategoryScores || !normalizedCertifiedAt || !Number.isFinite(Date.parse(normalizedCertifiedAt))) {
+    if (!isGovernanceScore(overallScore) || !validCategoryScores || normalizedCertifiedAt || !Number.isFinite(Date.parse(normalizedCertifiedAt))) {
       res.status(400).json({ error: { message: 'scores must be between 0 and 10 and certifiedAt must be a valid timestamp', code: 'VALIDATION_ERROR' } });
       return;
killedBy: runtime governance release HTTP contract rejects invalid baseline scores without writing and persists an in-range baseline
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BooleanLiteral
server/src/routes/runtime-governance.ts:58:95
       && typeof categoryScores === 'object'
       && !Array.isArray(categoryScores)
       && Object.values(categoryScores as Record<string, unknown>).every(isGovernanceScore);
-    if (!isGovernanceScore(overallScore) || !validCategoryScores || !normalizedCertifiedAt || !Number.isFinite(Date.parse(normalizedCertifiedAt))) {
+    if (!isGovernanceScore(overallScore) || !validCategoryScores || !normalizedCertifiedAt || Number.isFinite(Date.parse(normalizedCertifiedAt))) {
       res.status(400).json({ error: { message: 'scores must be between 0 and 10 and certifiedAt must be a valid timestamp', code: 'VALIDATION_ERROR' } });
       return;
killedBy: runtime governance release HTTP contract rejects invalid baseline scores without writing and persists an in-range baseline
statusReason: expected 200 to be 400 // Object.is equality

[Timeout] CallExpression
server/src/routes/runtime-governance.ts:59:7
       && !Array.isArray(categoryScores)
       && Object.values(categoryScores as Record<string, unknown>).every(isGovernanceScore);
     if (!isGovernanceScore(overallScore) || !validCategoryScores || !normalizedCertifiedAt || !Number.isFinite(Date.parse(normalizedCertifiedAt))) {
-      res.status(400).json({ error: { message: 'scores must be between 0 and 10 and certifiedAt must be a valid timestamp', code: 'VALIDATION_ERROR' } });
+      ;
       return;
     }

[Killed] CallExpression
server/src/routes/runtime-governance.ts:62:5
       res.status(400).json({ error: { message: 'scores must be between 0 and 10 and certifiedAt must be a valid timestamp', code: 'VALIDATION_ERROR' } });
       return;
     }
-    service.registerBaseline(req.params.agentId, { overallScore, categoryScores, certifiedAt: normalizedCertifiedAt });
+    ;
     res.json({ registered: true, agentId: req.params.agentId });
   });
killedBy: critical HTTP contracts exercises every runtime-governance and spawn control contract
statusReason: expected 404 to be 200 // Object.is equality
